Revit 2024 API
ParameterTypeId.SheetAssemblyManufacturer Property
 "Assembly: Manufacturer"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SheetAssemblyManufacturer { get; }
Visual Basic
Public Shared ReadOnly Property SheetAssemblyManufacturer As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SheetAssemblyManufacturer {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace